/**
 * @file read.cpp
 * 
 * @author your name (you@domain.com)
 * @brief 
 * @version 0.1
 * @date 2022-07-26
 * 
 * @copyright Copyright (c) 2022
 * 
 * 1、语言工具使用
 * -------C、C++的了解
 * 
 * 基本数据类型、条件跳转、循环
 * 
 * ---------数组、指针、引用
 * ---------结构体、函数
 * ---------------递归函数
 * 
 * 2、正式的数据结构
 * 
 * 2.1--线性表
 * -------顺序表
 * ------------------增删改查
 * ------------------归并
 * ------------------翻转
 * 
 * 
 * -------------链表及其变体
 * ------------------增删改查
 * ------------------归并
 * ------------------翻转
 * ------------------算法题
 * 
 * -------------栈
 * -------------队列
 * ------------------简易计算
 * ------------------算法应用
 * 
 * 2.2--数组、矩阵、广义表
 * 
 * 矩阵的压缩存储
 * -------(重点为:稀疏矩阵的三元组表示)
 * 
 * 2.3--树、二叉树(重点)
 * 
 * 
 * 2.4--图
 * 
 * 
 * 2.5--查找
 * 
 * 2.6--排序
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */